Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཏི་མུག་མེད་པའི་གནས་པ་རྣམ་པར་བརྩེ་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Playful Undeluded Existence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་བཅུ་ལ་རྟོག་ཅིང་མི་ཚུགས་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed for Unstoppable Understanding of the Ten Powers will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ཐེར་འབུམ་ཕྲག་རེ་རེ་དང་། དུང་ཕྱུར་ཕྲག་བདུན་བདུན་དང་བྱེ་བ་ཕྲག་བཞི་བཞིའོ། །
en: There will be thirty-six consecutive congregations of hearers, each of them gathering one billion bodhisattvas impeded by a single birth only, as well as seven hundred forty million others.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་བརྙེས་སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་སྤྲུལ་ཞིང་གསལ་བ་རབ་ཏུ་བརྒྱན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Jñānaprāpta will be born in a place called Created and Brightly Adorned with Wisdom.

source: ཡབ་ནི་ཡེ་ཤེས་འཕེལ་ཞེས་བྱའོ། །
en: Increasing Wisdom will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essence of Wisdom will be his mother.

source: སྲས་ནི་ཡེ་ཤེས་གསལ་ཞེས་བྱའོ། །
en: Clear Wisdom will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་ཉན་འདོད་ཅེས་བྱའོ། །
en: Wishing to Hear Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚུལ་ཐམས་ཅད་ཀྱིས་བདེན་པའི་ཁྱད་པར་གྱི་སྒྲ་སྒྲོགས་པ་ཞེས་བྱའོ། །
en: Proclaiming the Truth in All Possible Ways will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱའོ། །
en: Universal Display of Emanations will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་རེ་རེའོ། །
en: There will be sixty consecutive congregations of worthy ones, each of them gathering one hundred million.

source: དེ་བཞིན་གཤེགས་པ་གྲུབ་པ་སྐྱེ་བའི་ཡུལ་ནི་ནོར་བུ་རིན་པོ་ཆེས་ཁོང་སྣུམས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Siddhi will be born in a place called Shining with Precious Jewels.

source: ཡབ་ནི་བྱང་ཆུབ་ལ་དད་པའི་མིད་པ་ཞེས་བྱའོ། །
en: Consuming Faith in Awakening will be his father.

source: ཡུམ་ནི་ཉི་ཟླ་རྣམ་པར་མཐོང་བའི་འོད་ཅེས་བྱའོ། །
en: Light of Seeing the Sun and Moon will be his mother.

source: སྲས་ནི་རིན་ཆེན་མེ་ཏོག་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Precious Flowers will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་སྣང་བའི་སེམས་ཞེས་བྱའོ། །
en: Mind of Shining Qualities will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ནོར་སྦྱིན་མཐུ་རྩལ་མ་འཁྲུལ་སེམས་ཞེས་བྱའོ། །
en: Wealth-Granting Mind of Unerring Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་རེ་རེའོ། །
en: There will be five consecutive congregations of worthy ones, each of them gathering one hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be fifteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྨ་བྱ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Mayūra will be born in a place called Delightful Array.

source: ཡབ་ནི་ལག་ཤུགས་སྒྲ་སྐད་ཅེས་བྱའོ། །
en: Strong Hands and Language will be his father.

source: ཡུམ་ནི་མིའམ་ཅིའི་དབྱངས་ཞེས་བྱའོ། །
en: Kinnara Melody will be his mother.

source: སྲས་ནི་བརྡ་དང་སྒྲ་ཐམས་ཅད་པ་ཞེས་བྱའོ། །
en: Master of All Signs and Language will be his son.

source: རིམ་གྲོ་པ་ནི་གཏི་མུག་མེད་པའི་དབང་ཕྱུག་གནས་ཞེས་བྱའོ། །
en: Abiding by Mastery Free from Delusion will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རང་གི་སྒྲ་སྣང་བ་ཞེས་བྱའོ། །
en: Appearance of One’s Own Sounds will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་བ་བརྒྱ་སྟོང་གིས་རབ་ཏུ་བརྒྱན་པའི་ང་རོ་ཞེས་བྱའོ། །
en: Roar Adorned with a Hundred Thousand Virtues will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be fifty consecutive congregations of hearers, each of them gathering five million.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་སྦྱིན་སྐྱེ་བའི་ཡུལ་ནི་འོད་ཀྱི་བཀོད་པ་ཡང་དག་པར་བསྒྲུབས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Dharmadatta will be born in a place called Accomplishing the Array of Light.

source: ཡབ་ནི་ཆོས་ཀྱི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Dharma will be his father.

source: ཡུམ་ནི་ལེགས་པར་བསམས་པ་སེམས་པ་ཆོས་ཀྱི་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Dharma Intelligence of the Mind of Excellent Thoughts will be his mother.

source: སྲས་ནི་ཆོས་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of the Precious Dharma will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་ཀྱི་སྒྲོན་མའི་རྒྱལ་པོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: King of the Lamp of Dharma will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཐམས་ཅད་སྣང་བར་བྱེད་པའི་རྫུ་འཕྲུལ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Attaining the Miraculous Display That Illumines All Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གྱི་ཕུང་པོ་འཕགས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Sublime Splendor of Aggregated Qualities will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཉི་ཤུ་ཉི་ཤུའོ། །
en: There will be twenty-five consecutive congregations of hearers, each of them gathering twenty.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉི་ཁྲི་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain twenty-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཕན་པར་བཞེད་པ་སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་མ་སྨད་པའི་གཟུགས་ཞེས་བྱའོ། །
en: “The thus-gone Hitaiṣin will be born in a place called Form of Superior Fame.

source: ཡབ་ནི་དྲང་སྲོང་སེམས་གསལ་ཞེས་བྱའོ། །
en: Sage of Clear Mind will be his father.

source: ཡུམ་ནི་ཉི་མའི་གཟུགས་བརྡ་སྟོན་ཞེས་བྱའོ། །
en: Showing the Symbol of the Body of the Sun will be his mother.

source: སྲས་ནི་སྐྱེ་བའི་ཚུལ་སྣང་བར་བྱེད་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed for Illuminating the Ways of Taking Birth will be his son.

source: རིམ་གྲོ་པ་ནི་དགེ་བས་རབ་ཏུ་བརྒྱན་པ་ཞེས་བྱའོ། །
en: Adorned with Virtues will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་པ་མེད་པར་བརྩེགས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Stainless Heap will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་བག་ཚ་བ་མེད་པར་གནས་པ་ཞེས་བྱའོ། །
en: Remaining Undaunted by Means of All Qualities will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be ninety consecutive congregations of worthy ones, each of them gathering seven million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-one thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དགུ་ཁྲི་ཆིག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain ninety-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་བརྒྱན་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Jñānin will be born in a place called Splendidly Adorned with Wisdom.

source: ཡབ་ནི་ཡེ་ཤེས་ཀྱི་འབྱུང་གནས་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: Infinite Source of Wisdom will be his father.

source: ཡུམ་ནི་སྤོབས་པ་ཐམས་ཅད་སྟོན་པ་ཞེས་བྱའོ། །
en: Displayer of All Forms of Acumen will be his mother.

source: སྲས་ནི་དབྱངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་སེང་གེའི་སྒྲ་རྣམ་པར་སྒྲོགས་པ་ཞེས་བྱའོ། །
en: Roaring in the Lion Voice of the Royal Master of Melodies will be his son.

source: རིམ་གྲོ་པ་ནི་ཉི་མའི་གཟི་བརྗིད་ཀྱིས་རབ་ཏུ་བརྒྱན་པའི་ང་རོ་ཞེས་བྱའོ། །
en: Roar Adorned with the Splendor of the Sun will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒོམ་པ་ལ་དད་པའི་ཁྱིམ་གཏི་མུག་མེད་ཅིང་སྒྲིབ་པ་མེད་པར་གནས་པ་ཞེས་བྱའོ། །
en: Dwelling Free from Dullness or Stains within the Home of Faith in Meditation will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་གནས་པའི་བཀོད་པ་ཐུབ་པ་མེད་པའི་ཚོགས་སྟོན་པ་ཞེས་བྱའོ། །
en: Revealing the Gathering of the Invincible Indeterminate Array will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be eighty consecutive congregations of hearers, each of them gathering one million eight hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་རྒྱས་པ་ཡང་དག་པར་རྟོགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Yaśas will be born in a place called Full Realization through Joy.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བཞི་བཅུ་སྙེད་ཙམ་མོ། །
en: His light will extend as far as forty worlds of four continents.

source: ཡབ་ནི་བསམ་པ་ཐམས་ཅད་འཕགས་ཞེས་བྱའོ། །
en: Universally Superior Thought will be his father.

source: ཡུམ་ནི་ཡིད་ཀྱིས་སེམས་པ་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་ཞེས་བྱའོ། །
en: Satisfying the Mind Mentally will be his mother.

source: སྲས་ནི་བརྡ་སྐད་ཐམས་ཅད་ལ་རབ་ཏུ་སྤོབས་པ་ཞེས་བྱའོ། །
en: Acumen with Respect to All Symbols and Languages will be his son.

source: རིམ་གྲོ་པ་ནི་མི་ཐུབ་པའི་ཚོགས་ཀྱི་མཛོད་ཅེས་བྱའོ། །
en: Treasury of the Invincible Gathering will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷུན་པོའི་རྣ་རྒྱན་སྡུག་པ་ཉམས་དགའ་ཞེས་བྱའོ། །
en: Lovely and Delightful Earrings from Mount Meru will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་ཀུན་ཏུ་འོད་ཅེས་བྱའོ། །
en: Perfectly Luminous Jewels will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be twenty-two consecutive congregations of hearers, each of them gathering thirty-six billion.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་དྲ་བ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་དྲ་བ་མཐའ་ཡས་པ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Raśmijāla will be born in a place called Array of the Infinite Net of Jewels.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ལྔ་བཅུ་སྙེད་ཙམ་མོ། །
en: His light will extend as far as fifty worlds of four continents.

source: ཡབ་ནི་ཐུབ་པ་མེད་པའི་ཚོགས་སྟོན་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence That Reveals the Invincible Gathering will be his father.

source: ཡུམ་ནི་དགྲ་ཐུལ་གཟི་བརྗིད་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Splendid Intelligence That Tames the Enemy will be his mother.

source: སྲས་ནི་འདོད་བཞོ་ཡུལ་འཁོར་མཆོད་ཅེས་བྱའོ། །
en: Worship of the Land of Wish-Fulfilling Milking will be his son.

source: རིམ་གྲོ་པ་ནི་བརྡ་སྐད་ཟད་མི་ཤེས་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Mind of Inexhaustible Symbols and Language will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་པོ་ཆེའི་དྲ་བས་རྣམ་པར་བརྒྱན་པའི་མཛོད་ཅེས་བྱའོ། །
en: Treasury Adorned with Jewel Nets will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཀྱིས་ཕ་རོལ་གནོན་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Mind That Subdues Others with Diligence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be eighty consecutive congregations of hearers, each of them gathering one million six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་བཅོམ་པ་སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་མེད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Vijita will be born in a place called King Free from Suffering.

source: ཡབ་ནི་སེང་གེ་རྣམ་པར་རྩེ་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of a Frolicking Lion will be his father.

source: ཡུམ་ནི་རིན་ཆེན་མེ་ཏོག་ཅན་ཞེས་བྱའོ། །
en: Endowed with Jewel Flowers will be his mother.

source: སྲས་ནི་བརྟུལ་ཞུགས་འབྱུང་བའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Source of Yogic Discipline will be his son.

source: རིམ་གྲོ་པ་ནི་རྣམ་པར་སྣང་བྱེད་འོད་ཏོག་ཅེས་བྱའོ། །
en: Illuminating Light Crest will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱགས་པའི་སྐྱོན་དང་སྒྲིབ་པ་ཐམས་ཅད་སྤངས་པ་ཞེས་བྱའོ། །
en: Relinquishing All Flaws and Obscurations of Arrogance will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་པ་གསལ་བར་བརྩེགས་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind of the Teacher of the Luminous Peak will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་བདུན་བདུན་ནོ། །
en: There will be ninety consecutive congregations of hearers, each of them gathering two hundred seventy billion.

source: དེ་བཞིན་གཤེགས་པ་བཻ་དཱུརྱའི་སྙིང་པོ་སྐྱེ་བའི་ཡུལ་ནི་གློག་སྣང་བར་བྱེད་པ་ཤིན་ཏུ་འཕགས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Vaiḍūryagarbha will be born in a place called Splendid Flashes of Highly Superior Illumination.

source: ཡབ་ནི་རིན་ཆེན་སྙིང་པོ་འོད་ཅེས་བྱའོ། །
en: Light of the Essence of Jewels will be his father.

source: ཡུམ་ནི་བྱི་རུ་གསལ་ཞེས་བྱའོ། །
en: Luminous Coral will be his mother.

source: སྲས་ནི་བཟང་མཆོག་ཏོག་ཅེས་བྱའོ། །
en: Crest of Supreme Excellence will be his son.

source: རིམ་གྲོ་པ་ནི་བརྩོན་འགྲུས་བརྟན་པོས་ཕ་རོལ་གནོན་པ་ཅན་ཞེས་བྱའོ། །
en: Subjugator by Means of Stable Diligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་བཀོད་པའི་གོ་གྱོན་སེང་གེ་ཞེས་བྱའོ། །
en: Lion Who Bears the Garments of the Jewel Array will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕྱོགས་བཅུ་མཐོང་བས་རྣམ་པར་རྩེ་བའི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། །
en: Reveling in the Superknowledge of Seeing the Ten Directions will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be twenty-two consecutive congregations of hearers, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་མེ་ཏོག་གིས་རབ་ཏུ་བརྒྱན་པ་ཅེས་བྱའོ། །
en: “The thus-gone Puṣpa will be born in a place called Adorned with Jewel Flowers.

source: ཡབ་ནི་རིན་པོ་ཆེའི་མེ་ཏོག་ཐམས་ཅད་སྣང་བ་ཞེས་བྱའོ། །
en: Illumination of All Precious Flowers will be his father.

source: ཡུམ་ནི་རིན་པོ་ཆེའི་མེ་ཏོག་གིས་རབ་ཏུ་བརྒྱན་པའི་གཟི་བརྗིད་ཕུང་པོ་ཞེས་བྱའོ། །
en: Splendid Aggregation Adorned with Precious Flowers will be his mother.

source: སྲས་ནི་འཁྲུལ་པ་མེད་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind Free from Delusion will be his son.

source: རིམ་གྲོ་པ་ནི་མཐུ་རྩལ་ལེགས་པར་སྤྱོད་ཅེས་བྱའོ། །
en: Powerful Action will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ལྟ་བས་མཆོད་ཅེས་བྱའོ། །
en: Worship through the View of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྡ་སྐད་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of All Symbols and Language will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་གཉིས་བཅུ་གཉིས་སོ། །
en: There will be seventy consecutive congregations of hearers, each of them gathering one hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་ཉི་མ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Devarāja will be born in a place called Array of the Sun of Joy.

source: ཡབ་ནི་ལྷ་དད་རབ་བརྒྱན་ཅེས་བྱའོ། །
en: Adorned with Divine Faith will be his father.

source: ཡུམ་ནི་རིན་ཆེན་ལྷའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Precious Divine Essence will be his mother.

source: སྲས་ནི་ངན་སོང་ལས་འདས་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Intent on Going Beyond the Lower Realms will be his son.

source: རིམ་གྲོ་པ་ནི་ཆགས་མེད་སྤོབས་པ་བརྩེགས་ཞེས་བྱའོ། །
en: Peak of Courage of Nonattachment will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མངོན་པར་ཤེས་པའི་རྒྱལ་པོ་བྱང་ཆུབ་འཕགས་ཞེས་བྱའོ། །
en: King of Superknowledge with Noble Awakening will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་པ་ཐམས་ཅད་མགུ་ཞིང་མངོན་པར་དགའ་བར་སེམས་པ་ཞེས་བྱའོ། །
en: Intent on Bringing Satisfaction and Joy to All Beings of the World will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be eighty consecutive congregations of hearers, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྐྱེ་བའི་ཡུལ་ནི་ཚིག་ལ་མངོན་པར་དགའ་བ་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Śaśin will be born in a place called Delighting in Words.

source: ཡབ་ནི་འཇིག་རྟེན་པས་བསྔགས་པ་ཞེས་བྱའོ། །
en: Praised by the World will be his father.

source: ཡུམ་ནི་སེམས་གསལ་མ་ཞེས་བྱའོ། །
en: Clear Mind will be his mother.

source: སྲས་ནི་འཇིག་རྟེན་ཀུན་མཆོག་ཅེས་བྱའོ། །
en: Supreme in the Entire World will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོག་གི་ཡེ་ཤེས་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གྲགས་པ་འོད་ཅེས་བྱའོ། །
en: Light of Famed Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྲིད་པའི་རྒྱ་མཚོ་ཐམས་ཅད་ལས་རྒལ་བའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Endowed with the Mind That Crosses the Entire Ocean of Existence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་རེ་རེའོ། །
en: There will be fifty consecutive congregations of hearers, each of them gathering ten million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་དྲན་པའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་དྲན་པའི་གོ་བགོས་པ་གནས་ཀྱི་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Smṛtiprabha will be born in a place called Supreme Support for Donning the Robes of Mindfulness.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ལྔ་བཅུ་ཙམ་མོ། །
en: His light will extend as far as fifty worlds of four continents.

source: ཡབ་ནི་བསྐལ་པ་གྲངས་མེད་མཐོང་བར་སེམས་ཞེས་བྱའོ། །
en: Intent on Seeing Countless Eons will be his father.

source: ཡུམ་ནི་དུས་གསུམ་མཉམ་ཉིད་བློ་ཞེས་བྱའོ། །
en: Mind of the Equality of the Three Times will be his mother.

source: སྲས་ནི་རིན་པོ་ཆེའི་ཚོགས་ཀྱི་མཛོད་ཅེས་བྱའོ། །
en: Treasury of the Gathering of Jewels will be his son.

source: རིམ་གྲོ་པ་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱིས་རྣམ་པར་རྩེ་བའི་ང་རོ་ཞེས་བྱའོ། །
en: Roar of Reveling by Means of the Qualities of the Buddhas will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མྱ་ངན་སེལ་བ་བག་ཚ་བ་མེད་པ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Dispelling Suffering and Attaining Undauntedness will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྤྲུལ་པ་བཀོད་པ་ཞེས་བྱའོ། །
en: Array of Emanation by Means of All Learning will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱ་སྟེ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐེར་འབུམ་ཕྲག་སུམ་ཅུ་སྙེད་དོ། །
en: There will be one hundred consecutive congregations, each of them gathering thirty billion irreversible bodhisattvas.

source: དམ་པའི་ཆོས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ལོ་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: In order to let all bodhisattvas mature, his sacred Dharma will remain for twelve thousand years.

source: དེ་བཞིན་གཤེགས་པ་དགེ་བའི་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་མཁས་ཞེས་བྱ། །
en: “The thus-gone Kuśalaprabha Will be born in a place called Expertise Regarding the World.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཡབ་ནི་ལེགས་སེམས་ཡིན། །ཡོན་ཏན་བུ་ནི་རྒྱལ་ཡུམ་ཡོན་ཏན་སེམས། །སྲས་ཡིན་ཡོན་ཏན་ནོར་ནི་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend thirty-two leagues. “Excellent Mind will be his father, and Child of Qualities will be this victor’s mother. Mind of Qualities will be his son and Wealth of Qualities his attendant.

source: ཡོན་ཏན་ཚོགས་ཀྱི་ཏོག་ནི་བློ་ཅན་ཏེ། །
en: Crest of the Gathering of Qualities will be the one of intelligence

source: ཡོན་ཏན་ཐམས་ཅད་མཆོག་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Regarding All Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་མཐའ་ཡས་ཀུན་ལ་ཡང་། །བྱང་ཆུབ་དག་ལས་ཕྱིར་ནི་མི་ལྡོག་པ། །བྱེ་བ་འབུམ་ཕྲག་འབུམ་ཕྲག་འདུས་པར་འགྱུར། །
en: “There will be infinitely many consecutive congregations, Each of them gathering one trillion Who are irreversible with respect to awakening.

source: སྲིད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who has gone to the end of existence Will remain for seventy-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཞིང་ཁམས་ཀུན་ཏུ་སྐུ་གདུང་དག་གིས་ཁྱབ། །
en: The relics of this victor will be abundant, Filling all of the realms.

source: སངས་རྒྱས་ཡོན་ཏན་མཆོག་མ་ཀུན་འོད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་རྫུ་འཕྲུལ་སྣང་ཞེས་བྱ། །
en: “The buddha Sarva­vara­guṇa­prabha Will be born in a place called Appearance of Miraculous Displays.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་དྲི་མེད་འོད། །དཔག་ཚད་བཅུ་ཡོད་འོད་ཀྱི་དབང་པོ་ཡབ། །ཡོན་ཏན་ཚོགས་ནི་རྒྱལ་ཡུམ་ཡོན་ཏན་མཆོག །སྲས་ཡིན་ཡོན་ཏན་དབང་པོ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend ten leagues. “Master of Light will be his father, and Gathering of Qualities will be this victor’s mother. Supreme Qualities will be his son and Master of Qualities his attendant.

source: ཡོན་ཏན་དབང་པོ་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding Master of Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །མཚུངས་མེད་ཡོན་ཏན་ཀུན་བསགས་སྣང་མེད་ཐོབ། །སྦྱོར་བསྲེགས་བྱེ་བ་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering two hundred twenty million incomparable ones Who have gathered all qualities, attained nonappearance, and burned away the bonds.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one who attained nirvāṇa Will remain for twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་གསུམ་པ་བཀོད་པས་རྣམ་པར་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Three leagues large and beautifully decorated.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཡི་དཔལ། །སྐྱེ་བའི་ཡུལ་ནི་དཔལ་གྱི་ཚོགས་ཞེས་བྱ། །
en: “The thus-gone Ratnaśrī Will be born in a place called Gathering of Glory.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་གྲགས་པའི་དབང་པོ་ཡབ། །དཔལ་མཆོད་མ་ནི་རྒྱལ་ཡུམ་རིན་པོ་ཆེ། །སྲས་ཡིན་རིན་ཆེན་དཔལ་ནི་རིམ་གྲོ་པ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Master of Fame will be his father, and Glorious Worship will be this victor’s mother. Jewel will be his son and Jewel Glory his attendant.

source: གྲགས་པར་གནས་པ་ཤེས་རབ་ཅན་ཡིན་ཏེ། །
en: Remaining Renown will be the one of insight

source: མཁས་པ་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Expert the one of miracles.

source: ཀུན་ཀྱང་རི་བོ་ལྷུན་ལྟར་མི་གཡོ་བ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་སྙེད་ཡོད། །
en: “Each of them gathering two hundred forty million Who are immutable like majestic mountains.

source: ཡོངས་སུ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག ། ལོ་གྲངས་སུམ་ཁྲི་བརྒྱད་སྟོང་བར་དུ་གནས། །
en: When this teacher has attained parinirvāṇa The sacred Dharma will remain for thirty-eight thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་ས་ཡས་ཞིང་རྣམས་ཁྱབ་པར་འགྱུར། །
en: “The relics of this victor will be abundant, With millions of stūpas filling the realms.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེས་བུ་ཟླ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བས་བརྒྱན་ཞེས་བྱ། །
en: The thus-gone Manuṣyacandra Will be born in a place called Adorned with the Moon.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ལེགས་མཆོད་ཡིན། །ཟླ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend nine leagues. Excellent Worship will be his father, and Supreme Moon will be this victor’s mother.

source: སྲས་པོ་ཟླ་བཟང་ཟླ་བ་རིམ་གྲོ་པ། །
en: Moon will be his son and Excellent Moon his attendant.

source: བཞིན་ལྡན་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Countenance will be the scholar

source: འཇིག་རྟེན་རྣམ་པར་ལྟ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Beholding the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །ངར་མི་འཛིན་པ་མཁའ་དང་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be thirty consecutive congregations, Each of them gathering seven hundred twenty million “Who are free from grasping an ‘I’ and equal to space.

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །སུམ་ཅུ་རྩ་བདུན་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain For thirty-seven thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །གསེར་གྱི་རྒྱལ་མཚན་མཆོག་སྟོང་སྙེད་ཀྱིས་སྤྲས། །
en: “The relics of this victor will reside in a single stūpa Adorned with thousands of supreme golden banners.
